SOLU/FAIR4RS/testCase/singleDroplet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  any                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Set length units (optional, for clarity)
scale   0.1;    // 1 unit = 100 mm

// Define vertices of the cube
vertices
(
    (-1 -1 -1)
    (1 -1 -1)
    (1 1 -1)
    (-1 1 -1)
    (-1 -1 1)
    (1 -1 1)
    (1 1 1)
    (-1 1 1)
);

// Define one hexahedral block
blocks
(
    hex (0 1 2 3 4 5 6 7) (5 5 5) simpleGrading (1 1 1)
);

// Define edges (none needed for a cube)
edges
(
);

// Define boundary patches
boundary
(
    front
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    back
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    right
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
);

// No additional merge operations
mergePatchPairs
(
);

